Alex0704t/Project/FAT/stm32_fatfs.h
//--------------------------------------------------------------
// File     : stm32_ub_fatfs.h
//--------------------------------------------------------------

//--------------------------------------------------------------
#ifndef __STM32F4_UB_FATFS_H
#define __STM32F4_UB_FATFS_H


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include <FAT/fatfs/lo_level/stm32_atadrive.h> // ATA-Funktionen
#include <FAT/fatfs/lo_level/stm32_sdcard.h>   // SD-Funktionen
#include <FAT/fatfs/lo_level/stm32_usbdisk.h>  // USB-Funktionen
#include "stm32f4xx.h"
#include "fatfs/ff.h"                // FATFS-Funktionen


//--------------------------------------------------------------
// Medien-Typen (in dieser LIB nur MMC)
//--------------------------------------------------------------
typedef enum {
  MMC_0 = 0       // in dieser LIB wird nur "MMC" unterstuetzt
}MEDIA_t;


//--------------------------------------------------------------
// Fehlercodes
//--------------------------------------------------------------
typedef enum {
  FATFS_OK =0,
  FATFS_NO_MEDIA,
  FATFS_MOUNT_ERR,
  FATFS_GETFREE_ERR,
  FATFS_UNLINK_ERR,
  FATFS_OPEN_ERR,
  FATFS_CLOSE_ERR,
  FATFS_PUTS_ERR,
  FATFS_SEEK_ERR,
  FATFS_RD_STRING_ERR,
  FATFS_RD_BLOCK_ERR,
  FATFS_WR_BLOCK_ERR,
  FATFS_EOF,
  FATFS_DISK_FULL
}FATFS_t;


//--------------------------------------------------------------
// Modes fuer OpenFile
//--------------------------------------------------------------
typedef enum {
  F_RD =0,    // zum lesen oeffnen (nur falls File existiert)
  F_WR,       // zum schreiben oeffnen (nur falls File existiert) und Daten anhängen
  F_WR_NEW,   // zum schreiben oeffnen (und event. neu anlegen) und Daten anhängen
  F_WR_CLEAR  // zum schreiben oeffnen (alte Daten loeschen)
}FMODE_t;


//--------------------------------------------------------------
// Globale Funktionen
//--------------------------------------------------------------
void Fatfs_Init(void);
FATFS_t UB_Fatfs_CheckMedia(MEDIA_t dev);
FATFS_t UB_Fatfs_Mount(MEDIA_t dev);
FATFS_t UB_Fatfs_UnMount(MEDIA_t dev);
FATFS_t UB_Fatfs_DelFile(const char* name);
FATFS_t UB_Fatfs_OpenFile(FIL* fp, const char* name, FMODE_t mode);
FATFS_t UB_Fatfs_CloseFile(FIL* fp);
FATFS_t UB_Fatfs_WriteString(FIL* fp, const char* text);
FATFS_t UB_Fatfs_ReadString(FIL* fp, char* text, uint32_t len);
uint32_t UB_Fatfs_FileSize(FIL* fp);
FATFS_t UB_Fatfs_ReadBlock(FIL* fp, unsigned char* buf, uint32_t len, uint32_t* read);
FATFS_t UB_Fatfs_WriteBlock(FIL* fp, unsigned char* buf, uint32_t len, uint32_t* write);


//--------------------------------------------------------------
#endif // __STM32F4_UB_FATFS_H
